project/integrations/KNX_DOWNLOAD_AR_REPORT_01.00.0000/resources/application_119/inbound_120/resourcegroup_121/downloadPDFGenericSoapPort_REQUEST.wsdl

<definitions name="GenericSoapService" targetNamespace="urn:GenericSoap" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:ns0="http://www.oracle.com/UCM" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="urn:GenericSoap" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:shrq0="http://xmlns.oracle.com/types/downloadPDFGenericSoapPort/1680227649362/OutboundSOAPRequestDocument" xmlns:plnk="http://schemas.xmlsoap.org/ws/2003/05/partner-link/">  <types>    <xs:schema elementFormDefault="qualified" targetNamespace="http://www.oracle.com/UCM" version="1.0" xmlns:tns="http://www.oracle.com/UCM" xmlns:xs="http://www.w3.org/2001/XMLSchema">      <xs:element name="Field">        <xs:complexType>          <xs:simpleContent>            <xs:extension base="xs:string">              <xs:attribute name="name" type="xs:anySimpleType"/>            </xs:extension>          </xs:simpleContent>        </xs:complexType>      </xs:element>      <xs:element name="GenericRequest" type="tns:Generic"/>      <xs:element name="GenericResponse" type="tns:Generic"/>      <xs:complexType name="Generic">        <xs:sequence>          <xs:element name="Service" type="tns:Service"/>        </xs:sequence>        <xs:attribute name="webKey" type="xs:anySimpleType"/>      </xs:complexType>      <xs:complexType name="Service">        <xs:sequence>          <xs:element minOccurs="0" name="User" type="tns:Container"/>          <xs:element minOccurs="0" name="Document">            <xs:complexType>              <xs:complexContent>                <xs:extension base="tns:Container">                  <xs:sequence>                    <xs:element maxOccurs="unbounded" minOccurs="0" name="File" type="tns:File"/>                  </xs:sequence>                  <xs:anyAttribute namespace="##other" processContents="skip"/>                </xs:extension>              </xs:complexContent>            </xs:complexType>          </xs:element>        </xs:sequence>        <xs:attribute name="IdcService" type="xs:anySimpleType"/>      </xs:complexType>      <xs:complexType name="Container">        <xs:sequence>          <xs:element maxOccurs="unbounded" minOccurs="0" ref="tns:Field"/>          <xs:element maxOccurs="unbounded" minOccurs="0" name="ResultSet" type="tns:ResultSet"/>          <xs:element maxOccurs="unbounded" minOccurs="0" name="OptionList" type="tns:OptionList"/>        </xs:sequence>        <xs:anyAttribute namespace="##other" processContents="skip"/>      </xs:complexType>      <xs:complexType name="ResultSet">        <xs:sequence>          <xs:element maxOccurs="unbounded" minOccurs="0" name="Row" type="tns:Row"/>        </xs:sequence>        <xs:attribute name="name" type="xs:anySimpleType"/>      </xs:complexType>      <xs:complexType name="Row">        <xs:sequence>          <xs:element maxOccurs="unbounded" ref="tns:Field"/>        </xs:sequence>        <xs:anyAttribute namespace="##other" processContents="skip"/>      </xs:complexType>      <xs:complexType name="OptionList">        <xs:sequence>          <xs:element maxOccurs="unbounded" name="Option" type="xs:string"/>        </xs:sequence>        <xs:attribute name="name" type="xs:anySimpleType"/>      </xs:complexType>      <xs:complexType name="File">        <xs:sequence>          <xs:element name="Contents" ns1:expectedContentTypes="application/octet-stream" type="xs:base64Binary" xmlns:ns1="http://www.w3.org/2005/05/xmlmime"/>        </xs:sequence>        <xs:attribute name="name" type="xs:anySimpleType"/>        <xs:attribute name="href" type="xs:anySimpleType"/>      </xs:complexType>    </xs:schema>    <xs:schema elementFormDefault="qualified" targetNamespace="http://xmlns.oracle.com/types/downloadPDFGenericSoapPort/1680227649362/OutboundSOAPRequestDocument" xmlns="http://xmlns.oracle.com/types/downloadPDFGenericSoapPort/1680227649362/OutboundSOAPRequestDocument" xmlns:xs="http://www.w3.org/2001/XMLSchema">      <xs:import namespace="http://www.oracle.com/UCM"/>      <xs:element name="OutboundSOAPRequestDocument" type="OutboundSOAPRequestDocumentType"/>      <xs:complexType name="OutboundSOAPRequestDocumentType">        <xs:sequence>          <xs:element name="ConnectivityProperties" type="ConnectivityPropertiesType"/>          <xs:element name="Body" maxOccurs="1" minOccurs="1" type="BodyType"/>        </xs:sequence>      </xs:complexType>      <xs:complexType name="ConnectivityPropertiesType">        <xs:sequence>          <xs:element name="EndpointProperties" type="EndpointPropertiesType"/>          <xs:element name="SecurityProperties" type="SecurityPropertiesType"/>        </xs:sequence>      </xs:complexType>      <xs:complexType name="EndpointPropertiesType">        <xs:sequence>          <xs:element name="EndpointURI" type="xs:anyURI"/>          <xs:element name="SoapAction" type="xs:anyURI"/>        </xs:sequence>      </xs:complexType>      <xs:complexType name="SecurityPropertiesType">        <xs:sequence>          <xs:element name="Username" type="xs:string"/>          <xs:element name="Password" type="xs:string"/>          <xs:element name="ignoreNonce" type="xs:boolean"/>          <xs:element name="ignoreCreated" type="xs:boolean"/>        </xs:sequence>      </xs:complexType>      <xs:complexType name="BodyType">        <xs:sequence>          <xs:element ref="ns1:GenericRequest" xmlns:ns1="http://www.oracle.com/UCM"/>        </xs:sequence>      </xs:complexType>    </xs:schema>  </types>  <message name="GenericSoapOperationInput">    <part name="GenericRequest" element="ns0:GenericRequest"/>  </message>  <message name="GenericSoapOperationOutput">    <part name="GenericResponse" element="ns0:GenericResponse"/>  </message>  <portType name="GenericSoapPortType_downloadPDFGenericSoapPort_REQUEST">    <operation name="GenericSoapOperation">      <input message="tns:GenericSoapOperationInput" ns1:Action="urn:GenericSoap/GenericSoapOperation" xmlns:ns1="http://www.w3.org/2006/05/addressing/wsdl"/>      <output message="tns:GenericSoapOperationOutput" ns1:Action="urn:GenericSoap/GenericSoapPortType/GenericSoapOperationResponse" xmlns:ns1="http://www.w3.org/2006/05/addressing/wsdl"/>    </operation>  </portType>  <binding name="GenericSoapPortType_downloadPDFGenericSoapPort_REQUEST-binding" type="tns:GenericSoapPortType_downloadPDFGenericSoapPort_REQUEST">    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>    <operation name="GenericSoapOperation">      <soap:operation soapAction="urn:GenericSoap/GenericSoapOperation"/>      <input>        <soap:body use="literal"/>      </input>      <output>        <soap:body use="literal"/>      </output>    </operation>  </binding>  <plnk:partnerLinkType name="downloadpdfgenericsoapport_119_inbound_120">    <plnk:role name="GenericSoapPortType_downloadPDFGenericSoapPort_REQUEST">      <plnk:portType name="tns:GenericSoapPortType_downloadPDFGenericSoapPort_REQUEST"/>    </plnk:role>  </plnk:partnerLinkType></definitions>