UCM-PAYLOAD-SEARCH

<soapenv:Envelope
 xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ucm="http://www.oracle.com/UCM">
  <soapenv:Header>
  <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
          <wsse:UsernameToken wsu:Id="UsernameToken-2" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
          <wsse:Username>%%USERNAME%%</wsse:Username>
          <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">%%PASSWORD%%</wsse:Password>
          <wsu:Created>%%ISOTIME%%</wsu:Created>
        </wsse:UsernameToken>
    </wsse:Security>
    </soapenv:Header>
   <soapenv:Body>
      <ucm:GenericRequest webKey="cs">
           <ucm:Service IdcService="GET_SEARCH_RESULTS">
           <ucm:Document>
            <ucm:Field name="dSecurityGroup">FAFusionImportExport</ucm:Field>
            <ucm:Field name="dDocAccount">hcm$/dataloader$/export$</ucm:Field>
            <ucm:Field name="QueryText">dDocTitle &lt;starts&gt; `%%SEARCHFILE%%`</ucm:Field>
            <!-- ucm:Field name="QueryText">dOriginalName &lt;starts&gt; `%%SEARCHFILE%%`</ucm:Field -->
          </ucm:Document>
         </ucm:Service>
      </ucm:GenericRequest>
   </soapenv:Body>
</soapenv:Envelope>

